---
kind: property
id: P:Autodesk.Revit.DB.LinkLoadResult.IsNested
source: html/c1fe3ba8-74c9-2fe9-3d5f-c8a4f0b8db92.htm
---
# Autodesk.Revit.DB.LinkLoadResult.IsNested Property

True if these results represent a nested link; false otherwise.

## Syntax (C#)
```csharp
public bool IsNested { get; }
```

## Remarks
This property is only relevant for LinkLoadResult object for RvtLinkSymbol.
 ie. when getIsRvtLink() is true.